code-review/NRB_3471_3546/База_Стало/DataProcessors/ОчисткаВспомогательныхРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОчисткаВспомогательныхРегистров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоОбрабатываемыхЗаписейВТранзакцииSQL</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвояБДSQL</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОчистки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРегистра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагОчистки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОчистки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ОчисткаВспомогательныхРегистров/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ИнициализироватьНастройки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОчиститьПрогресс();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьПрогресс();
	Для Каждого Строка Из Объект.ДанныеОчистки Цикл
		Если Строка.ФлагОчистки Тогда
			Строка.Прогресс = "Очищается...";
			ОбновитьОтображениеДанных();
			КоличествоСтрок = 0;
			ОчиститьРегистрНаСервере(Строка.ИмяРегистра, Строка.ДатаОчистки, Строка.ПолеОтбора, КоличествоСтрок);
			Строка.Прогресс = "Готово";
			ОбновитьОтображениеДанных();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОчиститьРегистрНаСервере(ИмяРегистра, ДатаОчистки, ПолеОтбора, КоличествоСтрок)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОчиститьРегистр(ИмяРегистра, ДатаОчистки, ПолеОтбора, КоличествоСтрок);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПрогресс()
	Для Каждого Строка Из Объект.ДанныеОчистки Цикл
		Строка.Прогресс = "";
	КонецЦикла;
КонецПроцедуры
